{"supportEmailAddress":"sailorservices@decurtis.com","supportPhoneNumber":"+1 954 488 2955","categories":[{"sub-articles":[],"name":"Payments","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"1"},{"sub-articles":[{"visibleOnboard":"true","name":"Do you offer spa and salon services?","relatedFaqs":[],"nodeType":"faq","body":"Hair yeah we do! Whether you&#39;re looking for a fresh fade and beard groom or a bold new hair color (may we suggest scarlet), both Dry Dock and Stubble &amp; Groom will get you in tip-top shape! 💅💆","visibleToSailors":"true"}],"name":"Retail","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"12"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I make a call back home onboard?","relatedFaqs":[],"nodeType":"faq","body":"When available, you can purchase our Premium WiFi service to video call and VOIP home. Or you can choose to turn on cellular services and use our satellite link at sea to make a standard phone call home. Please note that the rates for calls at sea are set by your service provider, so we strongly recommend you check the rates before making a cellular call or using cellular data services on board.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"Can I tip extra for Crew on board?","relatedFaqs":[],"nodeType":"faq","body":"We&#39;ve already taken care of taking care of the Crew. So, don&#39;t worry, the tips are on us. However, if you insist, you&#39;re certainly able to leave additional tips with our Crew.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"Do you have a lost & found on board?","relatedFaqs":[],"nodeType":"faq","body":"Absolutely. You can find it at the Sailor Services desk on Deck 5.","visibleToSailors":"true"}],"name":"Sailor Services","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"14"},{"name":"Sales","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"15","sub-articles":[]},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a charge for ShipEats?","relatedFaqs":[],"nodeType":"faq","body":"Yes &mdash; there is $7 delivery charge for On Us items. However, that fee is waived if you&#39;re ordering a chargeable item - like a glass of wine or specialty coffee - or if you&#39;re staying in one of our RockStar Quarters.","visibleToSailors":"true"}],"name":"Ship Eats","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"16"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"When can I book a Shore Thing?","relatedFaqs":[],"nodeType":"faq","body":"All Sailors will have access to book a Shore Thing in our fabulous ports of call at least 45 days prior to their voyage date. For our Sailors booked in RockStar Quarters, they will have early access to start booking starts at 60 days prior.<br />\n&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"Where do I book a Shore Thing while on board?","relatedFaqs":[],"nodeType":"faq","body":"While on board, Sailors can book Shore things directly from our Sailor App or by stopping by The Chart Room on Deck 7.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"What do I do if I miss my Shore Thing departure?","relatedFaqs":[],"nodeType":"faq","body":"We get it, ship happens! If for any reason you miss your Shore Thing, please reach out to Sailor Services on Deck 5 or our Shore Things Crew, located at The Chart Room on Deck 7.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"Where do I catch my transportation pickup for my Shore Thing?","relatedFaqs":[],"nodeType":"faq","body":"Sailors will be able to locate their Shore Thing meeting point here on the Sailor App.","visibleToSailors":"true"}],"name":"Shore Things","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"17"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there wheelchairs available?","relatedFaqs":[],"nodeType":"faq","body":"Sailors requiring regular use of a wheelchair/scooter should bring their own or rent from one of our vendors. However, wheelchairs may be available for emergency use at the terminal for embarkation.<br />\n&nbsp;<br />\nYou can rent a wheelchair or scooter from our friends at:&nbsp;<br />\nScootaround (1-888-441-7575)<br />\n<a href=\"https://scootaround.com/en/cruise-services\">https://scootaround.com/en/cruise-services</a>","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Where can I rent a wheelchair for my voyage?","relatedFaqs":[],"nodeType":"faq","body":"You can rent a wheelchair or scooter from our friends at Scootaround (1-888-441-7575)<br />\n<a href=\"https://scootaround.com/en/cruise-services\">https://scootaround.com/en/cruise-services</a><br />\n&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do you provide wheelchair assistance on board?","relatedFaqs":[],"nodeType":"faq","body":"Wheelchair assistance is not provided on board or at our ports of call.","visibleToSailors":"true"}],"name":"Special Needs","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"18"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"What is The Band, and why do I need it?","relatedFaqs":[],"nodeType":"faq","body":"The Band is an integral part of our Sailors&rsquo; experience before, during and after their voyage. It was designed not to feel like a piece of technology but instead like a relaxed, nautical-inspired accessory (that also supports a healthy ocean). With The Band, Sailors can complete touchless payments and gain access to their cabins and quarters.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"If I lose my Band on board, will other Sailors be able to use it?","relatedFaqs":[],"nodeType":"faq","body":"No. The Band, our wearable tech made from recycled ocean plastic, contains a unique encrypted ID that allows us to see your security photo on our Crew devices. When our Crew look after you, we confirm the security photo associated with your band matches the Sailor wearing it.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Will I be able to use my Band on future voyages?","relatedFaqs":[],"nodeType":"faq","body":"Each Band is dedicated to a specific voyage, so you won&#39;t be able to use the same Band on a future voyage. Not to worry, we&#39;ll be sure to give you a new one.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"The Bands are so fashionable! Can I have more than one?","relatedFaqs":[],"nodeType":"faq","body":"Sailors will only receive one Band per sailing.&nbsp;<br />\nPRO TIP: Book another voyage, and we&#39;ll give you a brand new one for that sailing as well ;)","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"I love my red Band, but I want a black one. Can I request a new one?","relatedFaqs":[],"nodeType":"faq","body":"The colors of our Bands were designed specifically with our Sailors&#39; onboard experience in mind. As part of our RockStar Quarters offerings, Sailors booked in a suite will receive black and gold Bands.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"The packaging says The Band is made of recycled plastic. How much comes from the ocean?","relatedFaqs":[],"nodeType":"faq","body":"The rope material for The Band is built entirely from BIONIC&reg; yarn, and each Band removes two pounds of marine plastic from our oceans.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I recycle The Band?","relatedFaqs":[],"nodeType":"faq","body":"While the built-in battery prevents The Band from being recycled, we highly recommend reusing long after arriving back on land as a souvenir from your epic holiday at sea.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"My Band isn't working. What should I do?","relatedFaqs":[],"nodeType":"faq","body":"Head to Sailor Services on Deck 5 or chat us up on the app, and we&#39;ll work on resolving the issue for you.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"I lost my Band. What do I do now?","relatedFaqs":[],"nodeType":"faq","body":"Head to Sailor Services on Deck 5 or chat us up on the app, and we&#39;ll be happy to help you get it replaced.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I keep my Band?","relatedFaqs":[],"nodeType":"faq","body":"Of course! We&#39;ve designed The Band to be equally functional and stylish, with the hope that our Sailors will continue to wear it long after their voyage has ended.","visibleToSailors":"true"}],"name":"The Band","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"19"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"What is the drinking age on board?","relatedFaqs":[],"nodeType":"faq","body":"The drinking age in international waters is 18, in the United States it&#39;s 21, and in other ports, we&#39;ll go with whatever their country&#39;s laws specify.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What kind of drinking water system is available on board?","relatedFaqs":[],"nodeType":"faq","body":"All of our eateries will be serving filtered water. And Sailors will also have access to Natura self-serve filtered water stations throughout the ship that use their patented three-stage advanced filtration process. Together these efforts have eliminated the need for bottled water on board and will keep our Sailors hydrated and feeling fabulous.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"How does Bar Tab work?","relatedFaqs":[],"nodeType":"faq","body":"Bar Tab is Sailor Loot (AKA onboard credit) that&rsquo;s pre-purchased to spend on premium beverages all around our lady ships and at The Beach Club at Bimini. The best part? For every $300 purchased, you get an extra $50 on us. Get some cocktails on the house--or in this case, ship. Like most of our Sailor Loot, unused Bar Tab credit is not refundable at the end of a voyage, so drink up or feel free to share with a friend - or two!","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"I assume Bar Tabs cannot be used to pay for massages?","relatedFaqs":[],"nodeType":"faq","body":"As the name suggests, Bar Tab must only be used on premium beverage purchases. However, if you&#39;re looking for a little detox before you retox, Bar Tab can be used on both alcoholic and non-alcoholic drinks.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I use Bar Tab to buy drinks for other people?","relatedFaqs":[],"nodeType":"faq","body":"Of course! Bar Tab is designed to cover any premium drinks - whether they&#39;re for you, a mate or a stranger you befriend on board. Therefore, unlike traditional packages, we&#39;re not requiring every Sailor within a cabin to purchase a Bar Tab.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"I assume the term \"premium drinks\" includes non-alcoholic options?","relatedFaqs":[],"nodeType":"faq","body":"Absolutely! At Virgin Voyages, we truly believe life is about balance. So while alcohol can be purchased with Bar Tab, so can fresh-pressed juices and barista crafted specialty coffees.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"How do I Shake for Champagne?","relatedFaqs":[],"nodeType":"faq","body":"Just shake your phone three times while in the app, and see for yourself! Remember, you must be wearing your Band so that our Crew will be able to find you on board.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What time does coffee open in the morning?","relatedFaqs":[],"nodeType":"faq","body":"Complimentary drip coffee is available in The Galley 24/7 &mdash;&nbsp;so you can always get your caffiene fix there. The Grounds hours vary from day to day, so check the detail page in the app for further info.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a drink package?","relatedFaqs":[],"nodeType":"faq","body":"What&#39;s a holiday without a few choice cocktails? Your sailing includes our essential drinks and, while we don&#39;t have traditional packages, our drink offerings are very reasonably priced. If you&#39;re looking to set aside some loot for premium beverages, Sailors can also purchase our Bar Tab before setting sail.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What do I need to take with me to get drinks at the bar?","relatedFaqs":[],"nodeType":"faq","body":"All you need is The Band &mdash; in fact, that&#39;s what you&#39;ll use to make any purchases around the ship. So long as it&#39;s hooked up to a credit card or stocked with cash, you&#39;ll be all good.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Which beverages are free?","relatedFaqs":[],"nodeType":"faq","body":"Our essential drinks, which consist of filtered still and sparkling water, non-pressed juices, sodas, satchet teas and drip coffee, are all covered - On Us.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I bring my own wine to dinner?","relatedFaqs":[],"nodeType":"faq","body":"Of course! Our corkage fee is $25 at our eateries.","visibleToSailors":"true"}],"name":"Drinks","relatedFaqs":[],"shortDescription":"All transaction on board will be purchased with your <strong>wearable</strong>","nodeType":"faq-subcategory","order":"2"},{"sub-articles":[{"visibleOnboard":"true","name":"How can I make a spa reservation?","relatedFaqs":[],"nodeType":"faq","body":"Once on board, reservations can be made on the app or in person at Redemption.","visibleToSailors":"true"}],"name":"Well-being","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"20"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a safe in my cabin?","relatedFaqs":[],"nodeType":"faq","body":"Yes, all cabins are equipped with a safe for the protection of your valuables. Big enough to hold a 17&quot; laptop.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What is the dress code?","relatedFaqs":[],"nodeType":"faq","body":"We always want all of our Sailors to feel comfortable. We encourage you to wear more than a bathing suit if you go to a restaurant and kindly consider shoes, but your style is your style. Who are we to judge?<br />\n<br />\nDress Up. Dress Down. Just Dress.<br />\n<br />\nAt Virgin Voyages we&rsquo;re all about Sailors feeling free to express who they are and we know personal style is a huge part of that. Prescribing formal attire requirements just isn&rsquo;t our style.<br />\n<br />\nWe put a lot of trust in our Sailors to have some basic respect for each other, and to not show up to a full service restaurant in only pasties and earrings, a dripping wet bathing suit, a pair of sandy flip-flops or a fully mesh jumpsuit.<br />\nWe know, you know, that wearing shirts, pants and footwear is just the gracious way to dress in places where food is served. It also can&rsquo;t hurt to glam up, which is encouraged, in all eateries, especially our gorgeous full service restaurants like the Test Kitchen or The Wake.<br />\n<br />\nYour casual threads are probably nice enough to pass for dinner in any eatery, so come as you are, just not as you &ldquo;were&rdquo; when you got out of the shower please. Basically, please wear clothes in our eateries. Cheers!","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there going to be any religious services offered onboard?","relatedFaqs":[],"nodeType":"faq","body":"We do not host religious services on board.","visibleToSailors":"true"}],"name":"Misc","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"21"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Will there be assistance to claim a VAT refund on board?","relatedFaqs":[],"nodeType":"faq","body":"<p dir=\"ltr\">When purchasing VAT taxed items in our Retail stores, be sure to reach out to a member of our Retail Crew for assistance in filling out the form. Our Retail staff will have designated hours to assist with VAT purchases while on board. Hours of assistance can be found in the Daily Line Up and on the Virgin Voyages app. Please ensure to bring the following items with you to the High Street Shops, Deck 6, Portside:<br />\n&nbsp;</p>\n\n<ol>\n\t<li dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Passport</p>\n\t</li>\n\t<li dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">All receipts for onboard retail purchases (services not included)</p>\n\t</li>\n\t<li dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Credit or Debit card that the refund will go on</p>\n\t</li>\n\t<li dir=\"ltr\">\n\t<p dir=\"ltr\" role=\"presentation\">Valid email address</p>\n\t</li>\n</ol>\n","visibleToSailors":"true"}],"name":"VAT","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"22"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"How do I make a group dining reservation?","relatedFaqs":[],"nodeType":"faq","body":"If you&rsquo;re traveling in a group of 9 or more Sailors and wish to dine together, give our Sailor Services Crew a ring prior to your voyage to have your request submitted. Our Crew will then reach out to you with confirmation on availability.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"How do I let you know about my dietary restrictions?","relatedFaqs":[],"nodeType":"faq","body":"Just pop by the eatery and let our Crew know so that we can work with your restrictions. Please note, we are NOT an allergen-free kitchen.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Is food delivery available on board?","relatedFaqs":[],"nodeType":"faq","body":"A few delicious bites without leaving your seat, or wherever you happen to be at the moment? Say no more. Check out the Sailor App for all the info about onboard food and drink delivery.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I order breakfast room service the night before?","relatedFaqs":[],"nodeType":"faq","body":"Absolutely! Just be sure to get your orders in by 2am. Breakfast drop-off is 5 am - 11 am but please keep in mind that the pre-ordered breakfast is not available on disembarkation day.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do you have a caviar tasting?","relatedFaqs":[],"nodeType":"faq","body":"While we don&#39;t offer tastings, you can treat yourself to caviar bites and whole tin service for a charge at SIP Lounge.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do you have Kosher Meals?","relatedFaqs":[],"nodeType":"faq","body":"At this time, we do not offer certified Kosher meals.","visibleToSailors":"true"}],"name":"Eats","relatedFaqs":[],"shortDescription":"All transaction on board will be purchased with your <strong>wearable</strong>","nodeType":"faq-subcategory","order":"4"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there Wi-Fi on board?","relatedFaqs":[],"nodeType":"faq","body":"Yes, unlimited WiFi browsing is included for all Sailors. So there&#39;s no charge for social media, email, web browsing or messaging. For our Caribbean sailings, an upgraded premium entertainment package will also be available for just a bit extra to support streaming - subject to availability.<br />\n<br />\nA bit like on an airplane, WiFi at sea is restricted. Sailors using either our complimentary basic WiFi network or our Premium WiFi in the Caribbean may connect up to 2 devices simultaneously.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What type of entertainment can I expect on my voyage?","relatedFaqs":[],"nodeType":"faq","body":"Every sailing will feature a festival of choice in entertainment made up of bespoke experiences created exclusively for Virgin Voyages. From shows to parties, music and all types of happenings. On our ships, you&#39;ll never be bored, pinky promise.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"What time do the bars open and close?","relatedFaqs":[],"nodeType":"faq","body":"Fancy a drink - or two? Sailors can find the operating hours of each of our bars in the Discover &gt; Ship section of the app. Cheers to that!","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What type of machines and games will there be in the casino?","relatedFaqs":[],"nodeType":"faq","body":"Feelin&#39; lucky? Hope you said &quot;yes&quot; because our casinos will have a mix of traditional, vintage, and modern games available. So make sure to wear your lucky knickers (but leave the rabbit&#39;s foot at home).","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there special events for singles and married couples?","relatedFaqs":[],"nodeType":"faq","body":"<p style=\"line-height: 1.38;\">Virgin Voyages is for everyone; couples, uncouples and all types of daring travelers. Our solo meetups and experiences on board are designed for the already friends, couples and the soon to be friends.</p>\n","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there special events for honeymooners/singles/etc?","relatedFaqs":[],"nodeType":"faq","body":"At Virgin Voyages, we fully embrace and encourge diversity amongst all! Our onboard experiences were designed to bring like-minded Sailors together. With this in mind, we won&#39;t have any traditional meet and greets, but encourage our Sailors to find their folks through our mix of experiences.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there special events for the LGBTQIA?","relatedFaqs":[],"nodeType":"faq","body":"While our LGBTQIA Sailors will certainly enjoy all of our experiences onboard, we do not have specific events for groups.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What kind of theme events are there?","relatedFaqs":[],"nodeType":"faq","body":"Take what you know about traditional &quot;themed parties&quot; on cruises, and forget about it! We&#39;re skipping the 70s disco night and adding thematic elements that run throughout our amazing onboard experiences. From our PJ Party to Scarlet Night, we&#39;ll still encourage our Sailors to dress the part on occasion.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there movies onboard?","relatedFaqs":[],"nodeType":"faq","body":"While we&#39;re not currently planning to run movies in our public venues, we have a wide array of on-demand options in our Sailor cabins.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"Can I reserve my seat for the show?","relatedFaqs":[],"nodeType":"faq","body":"While we don&#39;t offer seating reservations for our shows at this time, we&#39;ve designed our entertainment venues so that every spot will feel like the best seat in the house.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can we get a tour of the bridge?","relatedFaqs":[],"nodeType":"faq","body":"Yes. As part of our behind the scenes tour, you can see where it all happens! There are several back of house sneak peeks included as well. The duration of the tour is 2.5 hours and costs $200. Once onboard, you can book through the Virgin Voyages App or stop by Sailor Services on Deck 5.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a charge for the shows?","relatedFaqs":[],"nodeType":"faq","body":"As part of your voyage fare, we&#39;ve included entertainment On Us! All shows and experiences are free, with the exception of Another Rose and certain eat and drink classes.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"Is there an entertainment schedule?","relatedFaqs":[],"nodeType":"faq","body":"FOMO? NO-MO! Once onboard, our entire entertainment lineup and happenings can be found daily in the Discover &gt; Lineup section of the app.&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Where do I go if I just wanna dance?","relatedFaqs":[],"nodeType":"faq","body":"On board our lady ships, anywhere is a good place to dance! However, if you&#39;re looking for our kickass nightclub, you can head to The Manor on Deck 6 and 7.","visibleToSailors":"true"}],"name":"Entertainment","relatedFaqs":[],"shortDescription":"All transaction on board will be purchased with your <strong>wearable</strong>","nodeType":"faq-subcategory","order":"5"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"How much are gratuities?","relatedFaqs":[],"nodeType":"faq","body":"We&#39;ve already taken care of taking care of the crew. So, don&#39;t worry, the tips are on us.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a fuel supplement charge?","relatedFaqs":[],"nodeType":"faq","body":"Nope, there is no charge for fuel supplements. We&#39;ve got you covered.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What are the methods of payment on board?","relatedFaqs":[],"nodeType":"faq","body":"All transactions on board will be purchased with your onboard account. Funds can be loaded and applied to your account with cash, Visa, MasterCard, Discover and American Express. Currencies accepted onboard is USD, so some Sailors may incur foreign transaction fees by their credit card company.&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I withdraw cash on board?","relatedFaqs":[],"nodeType":"faq","body":"Yes, there will be an ATM available.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"How do I track my wallet/folio balance?","relatedFaqs":[],"nodeType":"faq","body":"You can view your folio, and all your purchases, within the Sailor App.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"How do I pay for onboard purchases?","relatedFaqs":[],"nodeType":"faq","body":"All purchases can be made with The Band and a simple tap of your wrist.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I have more than one credit card on my folio account?","relatedFaqs":[],"nodeType":"faq","body":"While you can only have one card on file at a time, if you need or want to change your credit card, feel free to visit Sailor Services on Deck 5 to make the swap.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Will an authorization hold be placed on my credit card once on board? ","relatedFaqs":[],"nodeType":"faq","body":"Yes. Upon embarkation, we place a &ldquo;hold&rdquo; on your credit card on file (just like land-based hotels) for an initial $250 USD authorization. Outside of the initial authorization, we will submit incremental authorizations throughout the voyage to cover additional charges. Rest assured, we will only post one final folio total on disembarkation day, and pending holds will be released within 24-72 hours after the voyage by your credit card bank. &nbsp;","visibleToSailors":"true"}],"name":"Finance","relatedFaqs":[],"shortDescription":"All transaction on board will be purchased with your&nbsp;<strong>wearable</strong>","nodeType":"faq-subcategory","order":"6"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I ask for the seabed to stay a bed?","relatedFaqs":[],"nodeType":"faq","body":"Of course. It&#39;s your cabin, do what you want with it! Just reach out to our Sailor Services Crew or your cabin host, and they&#39;d be able to accommodate your requests.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Where can I get a beach/pool towel?","relatedFaqs":[],"nodeType":"faq","body":"Our pool towels are located up on the open deck at the Aquatic Club - Deck 15.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Is it possible to have a private party in my stateroom with snacks and drinks served?","relatedFaqs":[],"nodeType":"faq","body":"Of course &mdash; we love an excuse for a party. Snacks and drinks can be ordered through ShipEats, and if you&#39;re staying in one of our Mega RockStar Quarters, you can make arrangements through your RockStar Agent.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Are there irons and boards in the cabins?","relatedFaqs":[],"nodeType":"faq","body":"While irons and boards are not set up in our cabins, we do offer steamers on special request.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"false","name":"Are there pillow alternatives?","relatedFaqs":[],"nodeType":"faq","body":"Yes, we do offer pillow alternatives upon special request to Sailor Services.","visibleToSailors":"true"}],"name":"Housekeeping","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"7"},{"sub-articles":[],"name":"Add-On","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"7"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Where can I get my clothes pressed for my special night?","relatedFaqs":[],"nodeType":"faq","body":"With us! We have a full laundry service on board. You&#39;ll find a laundry slip in the cabin with instructions on what to do, or feel free to chat us on the app with any questions.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I do laundry onboard?","relatedFaqs":[],"nodeType":"faq","body":"While we don&#39;t have a self-service launderette on board, we do offer full laundry service where we can handle everything for you. You&#39;ll find a laundry slip in your cabin with instructions on what to do, or feel free to reach out to us on the app with any questions.","visibleToSailors":"true"}],"name":"Laundry","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory","order":"8"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"Is there a doctor on board?","relatedFaqs":[],"nodeType":"faq","body":"You bet. We&#39;ll have a licensed physician and nurses on board at all times while sailing.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What happens if I get sea sick?","relatedFaqs":[],"nodeType":"faq","body":"Medical Services are located on Deck 4. If it&#39;s an emergency, dial 911 on any phone, or press SOS on the app and tablet.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"I'm having motion discomfort. Where can I go for medical assistance?","relatedFaqs":[],"nodeType":"faq","body":"Head to Deck 4 where our Medical Services are located, and we can help get you sorted out.","visibleToSailors":"true"}],"name":"Medical","relatedFaqs":[],"shortDescription":"All transaction on board will be purchased with your <strong>wearable</strong>","nodeType":"faq-subcategory","order":"9"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"false","name":"How can I request for my seabed to stay a bed?","relatedFaqs":[],"nodeType":"faq","body":"Of course! Sailors can request to keep their Seabed in sleep mode by contacting Sailor Services in the app.&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","name":"Where can I buy the sheets in my cabin?","relatedFaqs":[],"nodeType":"faq","body":"At this time, our bed sheets are not for sale and can only be found on board our lady ships.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"How do I close the blinds in my cabin?","relatedFaqs":[],"nodeType":"faq","body":"Our state-of-the-art cabin tablets allow you to open and close the shades and even select pre-programmed modes for any mood. Hangover approved 😎","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I decorate my cabin door? ","relatedFaqs":[],"nodeType":"faq","body":"We think our lady ships look fabulous as they are, and door decorations inevitably lead to unsightly damage. &nbsp;<br />\n&nbsp;","visibleToSailors":"true"}],"name":"Cabins","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"What are Virgin Voyages' Safety & Security policies?","relatedFaqs":[],"nodeType":"faq","body":"The safety and security of our guests is our top priority. We operate in full compliance with &mdash; and in many cases exceed &mdash; U.S. and international safety regulations. You can find more information, and our Security Guide, <a data-sheets-formula-bar-text-link=\"https://www.virginvoyages.com/safety-security\" data-sheets-formula-bar-text-style=\"font-size:13px;color:#1155cc;font-weight:normal;text-decoration:underline;font-family:''docs-Calibri'';font-style:normal;text-decoration-skip-ink:none;\" href=\"https://www.virginvoyages.com/safety-security\">here</a>.","visibleToSailors":"true"},{"visibleOnboard":"true","name":"How long can I leave my stuff unattended on sun chairs/loungers?","relatedFaqs":[],"nodeType":"faq","body":"In fairness to all our Sailors on board, we think everyone deserves a spot in the sun. &nbsp;If you leave any items unattended on chairs or loungers for more than 40 minutes, we will remove it and safely store it in lost property located at Sailor Services on Deck 5 Mid.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Can I spread a loved one's ashes during my voyage?","relatedFaqs":[],"nodeType":"faq","body":"Yes - we are deeply honored that you&rsquo;re looking to memorialize the life of your beloved family member on board our ship. We cherish our Sailors and understand the importance of paying respects to those important in their lives.&nbsp;<br />\n<br />\nPlease reach out to our Sailor Services Crew with the information below. Once provided this information, we&rsquo;ll work with our local officials and shipboard teams to ensure that this Celebration of Life can take place on board and will confirm with you prior to your voyage:&nbsp;<br />\n- Ship<br />\n- Sail Date&nbsp;<br />\n- Party size<br />\n&nbsp;<br />\nYou can contact Sailor Services at 954-488-2955 for US Sailors, +44 (20) 30034919 for UK or +61 (1800) 491708 for AUS.","visibleToSailors":"true"}],"name":"Policies","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory"},{"sub-articles":[{"visibleOnboard":"true","visiblePreSail":"true","name":"What happens if a Sailor feels sick or tests positive while on board?","relatedFaqs":[],"nodeType":"faq","body":"Sailors who are experiencing symptoms of COVID-19 should immediately contact our medical center so that we can provide the appropriate care and treatment if required. Our Medical Crew is equipped to test for COVID-19.<br />\n<br />\nIn the event a positive case of COVID-19 is identified, we immediately enact a series of proven protocols, including isolation and contact tracing, to identify, isolate and mitigate any further transmission. These measures are above and beyond most other industries because we are resolutely focused on keeping our Crew and Sailors well.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What if a Sailor tests positive prior to their voyage?","relatedFaqs":[],"nodeType":"faq","body":"Sailors who test positive within 10 days prior to their voyage will be denied boarding.<br />\n<br />\nWe of course want to voyage with them when the timing is right, so they can give us a ring at <a href=\"tel:+19544882955\">954-488-2955</a> for US Sailors or <a href=\"http://+442030034919\">+44 (20) 30034919</a> for UK, and we will go over options for them.<br />\n<br />\n<br />\n&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What if a Sailor recently recovered from COVID-19 yet is testing positive with a PCR?","relatedFaqs":[],"nodeType":"faq","body":"In line with the CDC, Sailors who are asymptomatic will be permitted to board if they have a doctor&#39;s note to show proof of recovery within 90 days.<br />\n<br />\nSailors who test positive and are symptomatic (feeling unwell) will be denied boarding.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What if a Sailor feels sick before their voyage?","relatedFaqs":[],"nodeType":"faq","body":"In line with the CDC&rsquo;s general guidance, if a Sailor is not feeling well in the days leading up to their sailing, they should follow isolation and quarantine guidelines and will not be permitted to board.<br />\n<br />\nIf Sailors have experienced any symptoms of COVID-19 or have come in contact with anyone testing positive within 10 days of your voyage, they will not be permitted to board.<br />\n<br />\nPlease give us a ring at <a href=\"tel:+19544882955\">954-488-2955</a> for US Sailors or <a href=\"tel:+442030034919 \">+44 (20) 30034919</a>&nbsp;for UK, and we&rsquo;ll go over the options for you.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What proof will I need to show for my vaccination status?","relatedFaqs":[],"nodeType":"faq","body":"We request fully vaccinated Sailors to bring their original government-issued vaccination card. If it is not provided, a COVID-19 test will need to be taken at the terminal for a fee of $75.<br />\n<br />\nVaccinated Sailors will also have the option to bring a negative COVID-19 test taken within 72 hours if they do not have their vaccination card on the day of embarkation.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What types of vaccines do you accept?","relatedFaqs":[],"nodeType":"faq","body":"Sailors who are fully vaccinated (14 days past last dose) should have received WHO- or FDA-approved vaccines, which currently include the following:<br />\n<br />\n&middot; Pfizer/BioNTech/Comirnaty<br />\n&middot; Oxford/AstraZeneca/Vaxzevira<br />\n&middot; Covidshield<br />\n&middot; Janssen/Johnson &amp; Johnson/Ad26.COV2.S<br />\n&middot; Moderna/Spikevax<br />\n&middot; Sinopham/Covilo<br />\n&middot; Sinovac/CoronaVac<br />\n&middot; Covaxin<br />\n&middot; Novavax/Nuvaxovid<br />\n&middot; Covovax/Novovax Formulations","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What happens if I am sick with a different illness than COVID-19 within 14 days of my voyage?","relatedFaqs":[],"nodeType":"faq","body":"If a Sailor is not feeling well with any symptoms, even those different from COVID-19, they would not be permitted to board. We take all illnesses seriously, as the safety of our Sailors and Crew is our top priority. If a Sailor needs to make changes to a booking and switch to a later date due to an illness, they can give our Sailor Services Crew a ring at 954-488-2955 for US Sailors or +44 (20) 30034919 for UK.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What type of masks do you accept?","relatedFaqs":[],"nodeType":"faq","body":"In line with the CDC, we recommend masks that fit snugly and fully cover your mouth and nose. We expect most Sailors to arrive at the ship with their personal mask, but replacement masks will be available free of charge to those who&rsquo;ve lost theirs during the voyage. Masks are also provided in Sailor cabins.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do you have replacement masks on board?","relatedFaqs":[],"nodeType":"faq","body":"Yes. While we expect most Sailors to arrive at the ship with their personal mask, we do have replacement masks available free of charge to those who&rsquo;ve lost theirs during the voyage. Masks are also provided in Sailor cabins.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Will Sailors receive a refund for any time spent quarantined onboard?","relatedFaqs":[],"nodeType":"faq","body":"A prorated voyage fare refund will be given to anyone who has their cruise cut short due to testing positive for COVID-19, or being suspected of having COVID-19 during the sailing.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What updates is Virgin Voyages making to COVID protocols?","relatedFaqs":[],"nodeType":"faq","body":"Please refer to our <a href=\"https://www.virginvoyages.com/voyage-well\">Voyage Well</a> page for our most up-to-date health and safety updates.&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"What happens if I make a booking and later get sick with Covid or test positive?","relatedFaqs":[],"nodeType":"faq","body":"If a Sailor tests positive, is experiencing symptoms, or is exposed to someone testing positive within 10 days of their voyage, we will offer flexible options including Future Voyage Credit to sail when the timing is right.<br />\n<br />\nIn the event a positive case of COVID-19 is identified on board, we immediately enact a series of proven protocols, including isolation and contact tracing, to identify, isolate and mitigate any further transmission. A prorated voyage fare refund will be given to anyone who has their cruise cut short due to testing positive for COVID-19, or being suspected of having COVID-19 during the sailing.<br />\n<br />\nIf a Sailor feels unwell or has tested positive for COVID-19 after the voyage, they can reach out directly to <a href=\"mailto: healthcheck@virginvoyages.com?subject=Virgin%20Voyages%20Voyage%20Well%20concern&amp;body=Booking%20Number%3A%0AVoyage%20Date%3A%20%0ACabin%20Number%3A%0A\">healthcheck@virginvoyages.com</a> with their booking number, voyage date, and cabin number, and our medical team will conduct proper contact tracing.<br />\n<br />\nNOTE: Bookings made on or before May 31st, 2022, for sailings through Oct. 15, 2022, may cancel up to 48 hours before the voyage to receive a Future Voyage Credit. This includes, but is not limited to, Sailors who test positive, have symptoms, or are exposed to COVID-19 48 hours before their voyage. Within this flexible policy, they can switch their voyage to a later date using Future Voyage Credit&ndash;no questions asked.<br />\n&nbsp;","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do Sailors have to wear a mask while on a Shore Thing?","relatedFaqs":[],"nodeType":"faq","body":"Sailors will be required to wear masks if mandated by local regulations in port of call.","visibleToSailors":"true"},{"visibleOnboard":"true","visiblePreSail":"true","name":"Do I have to wear a mask on board?","relatedFaqs":[],"nodeType":"faq","body":"Our most important goal is to keep you safe and healthy, and with emerging variants &mdash; we all need to be extra mindful while traveling. Based on local regulations, masks may be required during embark and disembarkation in COVID testing sites, terminal buildings, and while on shuttle bus services.<br />\n<br />\nMasks will be provided on request. We&rsquo;ll be following local government guidelines at each port as it pertains to mask-wearing, and we ask that you follow the experts&rsquo; advice and do the same while traveling.","visibleToSailors":"true"}],"name":"Voyage Well","relatedFaqs":[],"shortDescription":"","nodeType":"faq-subcategory"}],"deckLocation":"Deck 5 Mid-Aft","externalId":"61f826600d44ccd6bef0688f","name":"Sailor Services","virtualQueuesBackgroundImage":"https://cms.res.virginvoyages.com/dam/jcr:67e418c6-7688-4ee1-8a01-5d56a8c6a67a/IMG-APP-sailor-services-virtual-queue-background-2-1200x1920.jpg"}